bivex/ArchC/tests/stm32/stm32_arch_ref.H
/******************************************************
 * ArchC Resources header file.                       *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#ifndef  _STM32_ARCH_REF_H
#define  _STM32_ARCH_REF_H

#include  "stm32_parms.H"
#include  "ac_arch_ref.H"
#include  "ac_memport.H"
#include  "ac_reg.H"
#include  "ac_regbank.H"


//!Forward class declaration, needed to compile.
class stm32_arch;

//!ArchC class for model-specific architectural resources.
class stm32_arch_ref : public ac_arch_ref<stm32_parms::ac_word, stm32_parms::ac_Hword> {
public:
 
  //!Program Counter.
  ac_reg<unsigned>& ac_pc;

  //!Processor Id.
  ac_reg<unsigned>& ac_id;

  //!Storage Devices.
  ac_memport<stm32_parms::ac_word, stm32_parms::ac_Hword>& DM;
  ac_memport<stm32_parms::ac_word, stm32_parms::ac_Hword>& FLASH;
  ac_memport<stm32_parms::ac_word, stm32_parms::ac_Hword>& SRAM;
  ac_memport<stm32_parms::ac_word, stm32_parms::ac_Hword>& PERIPH;
  ac_regbank<16, stm32_parms::ac_word, stm32_parms::ac_Dword>& R;
  ac_reg<stm32_parms::ac_word>& xpsr;
  ac_reg<stm32_parms::ac_word>& primask;
  ac_reg<stm32_parms::ac_word>& control;

  //!Constructor.
   stm32_arch_ref(stm32_arch& arch);

};

#endif  //_STM32_ARCH_REF_H
